Tekla Open API Reference for Tekla Structures 2025
WindowBase.InitializeAngleUnitDecimals Method
 Gets the number of decimals Tekla Structures uses for displaying the angle unit and initializes Angle class to use that.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool InitializeAngleUnitDecimals()
Public Shared Function InitializeAngleUnitDecimals As Boolean
Return Value
Type: Boolean
True if successful. False if failed.
See Also
Reference
WindowBase Class
Tekla.Structures.Dialog Namespace